[net]
batch=8
subdivisions=1
height=10
width=1
channels=1

learning_rate=0.001
momentum=0.9
policy=constant

power=4
angle=1
hue=1
saturation=1
exposure=1
aspect=1

[connected]
output=64
activation=relu

[dropout]
probability=0.5

[connected]
output=16
activation=relu

[connected]
output=2
activation=linear

[softmax]
groups=1

[cost]
type=sse
